### Definição de DataFrame: é um objeto bi-direcional que contem dados em forma tabular. Ou seja, é como se fosse uma tabela do Excel , que é possível adicionar linhas e colunas.

In [1]:
import pandas as pd

### Criando um DataFrames

In [2]:
df = pd.DataFrame()

In [3]:
df

Empty DataFrame
Columns: []
Index: []

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
# Como já sabemos trabalhar com Dicionários, agora podemos criar um dataframe!

dict1 = {'Identificacao': [1,2,3,4,5],
         'Nome': ['Caio','Rodrigo','Rafael','Efraim','Luiza']}

In [6]:
dict1

{'Identificacao': [1, 2, 3, 4, 5],
 'Nome': ['Caio', 'Rodrigo', 'Rafael', 'Efraim', 'Luiza']}

In [7]:
df2 = pd.DataFrame(data = dict1) # o parametro data significa dados e não é obrigatório o uso dele.

In [8]:
df2

   Identificacao     Nome
0              1     Caio
1              2  Rodrigo
2              3   Rafael
3              4   Efraim
4              5    Luiza

In [9]:
df2 = pd.DataFrame(dict1)

In [10]:
df2

   Identificacao     Nome
0              1     Caio
1              2  Rodrigo
2              3   Rafael
3              4   Efraim
4              5    Luiza

In [11]:
df3 = pd.DataFrame(dict1, index = [29,1,0,2222,88])# criando e passando paramentros de index

In [12]:
df3

      Identificacao     Nome
29                1     Caio
1                 2  Rodrigo
0                 3   Rafael
2222              4   Efraim
88                5    Luiza

In [13]:
serie = pd.Series([1,2,3]) # Series são colunas que podemos adicionar

In [14]:
serie

0    1
1    2
2    3
dtype: int64

In [15]:
type(serie)

pandas.core.series.Series

In [16]:
serie1 = pd.Series(['a','b','c'])

In [17]:
df4 = pd.DataFrame({'coluna1': serie,
                    'coluna2': serie1})

In [18]:
df4

   coluna1 coluna2
0        1       a
1        2       b
2        3       c

### Criando DataFrame utilizando Numpy

In [19]:
import numpy as np

In [20]:
array1 = np.array( [ [1, 2, 3],
                     ['São Paulo','Rio de Janeiro', 'Campinas'],
                     ['SP','RJ','SP'] 
                   ] )

In [21]:
array1

array([['1', '2', '3'],
       ['São Paulo', 'Rio de Janeiro', 'Campinas'],
       ['SP', 'RJ', 'SP']], dtype='<U14')

In [22]:
type(array1)

numpy.ndarray

In [23]:
df5 = pd.DataFrame(data = array1.transpose(), 
                   index = ['linha1','linha2','linha3'], 
                   columns = ['Identificacao','Cidade','Estado'])

In [24]:
df5

       Identificacao          Cidade Estado
linha1             1       São Paulo     SP
linha2             2  Rio de Janeiro     RJ
linha3             3        Campinas     SP

In [25]:
matriz1 = np.matrix( [ [1, 2, 3],
                      ['São Paulo','Rio de Janeiro', 'Campinas'],
                      ['SP','RJ','SP'] ] )

In [26]:
type(matriz1)

numpy.matrix

In [27]:
matriz1

matrix([['1', '2', '3'],
        ['São Paulo', 'Rio de Janeiro', 'Campinas'],
        ['SP', 'RJ', 'SP']], dtype='<U14')

In [28]:
df6 = pd.DataFrame(data = matriz1.transpose(), 
                   index = ['linha1','linha2','linha3'], 
                   columns = ['Identificacao','Cidade','Estado'])

In [29]:
df6

       Identificacao          Cidade Estado
linha1             1       São Paulo     SP
linha2             2  Rio de Janeiro     RJ
linha3             3        Campinas     SP